Span Direction Symbol can only be placed in a Floor Plan View.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId NonPlanView { get; }
  Visual Basic
Public Shared ReadOnly Property NonPlanView As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ NonPlanView {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures SpanDirectionSymbolFailures Class
  Autodesk.Revit.DB Namespace